// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor).
// Скласти результат цих чисел в змінній result.

//
//     let a = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
//
//     let result = a[0] + a[1] + a[2] + a[3] + a[4] + a[5] + a[6] + a[7] + a[8] + a[9] + a[10];
//
//     console.log(result);
//

// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори.' +
// ' Вивести кожну книгу як окремий об'єкт

//
//     let book1 = {
//         name: 'idk',
//         pages: 20,
//         genre: 'adventure'
//     }
//
//     let book2 = {
//         name: 'ik',
//         pages: 20,
//         genre: 'adventure',
//         author: 'SpangeBob'
//     }
//
//     let book = [book1, book2]
//     console.log(book[0])
//     console.log(book[1])
//

// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.

//
//     let height = prompt('Вкажіть висоту');
//     let width = prompt('Вкажіть ширину');
//
//     let s = `${height * width}`
//
//     alert(s)
//

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.


//
//     let heightC = prompt('Вкажіть висоту');
//     let dC = prompt('Вкажіть діаметр основи');
//
//     let v = `${heightC * dC}`
//
//     alert(v)
//



// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь)
// // або оператор зведення в ступінь **).

    // let n = 3;
    // let m = 4;
    // let k = Math.pow(3,2) + Math.pow(4,2)
    // console.log(k)
    //
    // let a = Math.sqrt(k)
    // console.log(a)





